src/main/resources/get-x3-integration-status-request.xml

<soapenv:Envelope
		xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
		xmlns:xsd="http://www.w3.org/2001/XMLSchema"
		xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
		xmlns:wss="http://www.adonix.com/WSS" xsi:schemaLocation="http://www.adonix.com/WSS">
	<soapenv:Header/>
	<soapenv:Body>
		<wss:run soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<callContext xsi:type="wss:CAdxCallContext">
				<codeLang xsi:type="xsd:string">ENG</codeLang>
				<poolAlias xsi:type="xsd:string">DEV</poolAlias>
				<poolId xsi:type="xsd:string"></poolId>
				<requestConfig xsi:type="xsd:string">
					<![CDATA[adxwss.optreturn=XML&adxwss.beautify=true]]>
				         </requestConfig>
			</callContext>
			<publicName xsi:type="xsd:string">AOWSBATGET</publicName>
			<inputXml xsi:type="xsd:string">
				<![CDATA[{
				             "GRP1": {  
				                 "I_TACHE": "IMPORT",  
				                    "I_REQNUM": "#REQNUM#",
				                    "I_GETTRA": "YES"  
				                }  
				               }]]>  
				          </inputXml>
		</wss:run>
	</soapenv:Body>
</soapenv:Envelope>